list = 'ΨΠΧΧΨΨΠΧΧΠΠΨΠΧΨΠΧ' #δημιουργία τυχαίως προκαθορισμένης συμβολοσειράς
x=0
while True: #αρχή συνεχόμενης loop
    user_action = input("Διάλεξε (π)έτρα, (ψ)αλίδι, (χ)αρτί: ").upper()  
    while user_action not in ["π", "Π", "ψ", "Ψ", "χ", "Χ"]: #έλεγχος εάν έχουν δοθεί έγκυρα σύμβολα από τον χρήστη
        print("Έδωσες λάθος επιλογή, δώσε κάτι από (π,Π,ψ,Ψ,χ,Χ)") #εμφάνιση κατάλληλου μηνύματος σε περίπτωση σφάλματος
        user_action = input("Διάλεξε (Π)έτρα, (Ψ)αλίδι, (Χ)αρτί: ")
    PC_action = list[x] #ο υπολογιστής κάνει την επιλογή του από την συμβολοσειρά
    if x == len(list) -1: 
        x = 0 #εάν τα σύμβολα εξαντληθούν ξεκινάει η προσπέλαση τους από την αρχή
    else:
	    x = x + 1 #επιλογή αμέσως επόμενου συμβόλου
    print(f"\n υπολογιστής διάλεξε {PC_action}.\n")
    if user_action == PC_action:  #παράμετροι για την έκβαση του παιχνιδιού και αποτελέσματα
       print(f"Ισοπαλία!")
    elif user_action == ("Π" or "π"):
         if PC_action == "Ψ":
            print("Κέρδισες!")
         else:
            print("Έχασες!")
    elif user_action == ("Χ" or "χ"):
        if PC_action == "Π":
           print("Κέρδισες!")
        else:
           print("Έχασες!")
    elif user_action == ("Ψ" or "ψ"):
        if PC_action == "Χ":
           print("Κέρδισες!")
        else:
           print("Έχασες!")
    replay = input("Θες να ξαναπαίξεις? (ΝΑΙ/ΟΧΙ): ") .upper() #μήνυμα ερώτησης στον χρήστη για συνέχιση παιχνιδιού
    if replay != "ΝΑΙ" or replay == "" or replay == " ": #παράμετρος όπου το loop τερματίζει
        break
